### 1/5: STUDENT

In [66]:
# STUDENT dataframe
import csv
import pandas as pd

with open('student.csv') as student_file:
    student = pd.read_csv(student_file, ',', None, header='infer');
#student_df = pd.DataFrame(student)

In [67]:
# ==== Describing the data ===

# student.shape #(3, 2)
# len(student) # rows - 3
# student.describe()
student

   sid  name
0    1  Jill
1    2    Bo
2    3  Maya

In [8]:
student['sid'].value_counts() # sid column

3    1
2    1
1    1
Name: sid, dtype: int64

In [9]:
student['name'].value_counts() # name column

Maya    1
Bo      1
Jill    1
Name: name, dtype: int64

In [10]:
student['name'].nunique() # num unique values in column

3

### 2/5: TAKES

In [68]:
with open('takes.csv') as takes_file:
    takes = pd.read_csv(takes_file, ',', None, header='infer');

In [69]:
takes

   sid expGrade      cid  sem
0    1        A  550-001  S15
1    1        A  677-001  S15
2    3        C  521-001  F15
3    3        C  550-001  S15

In [70]:
takes['sid'].nunique() # only 2

2

In [71]:
takes.columns # column names

Index(['sid', 'expGrade', 'cid', 'sem'], dtype='object')

In [72]:
takes.info() # general df info

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
sid         4 non-null int64
expGrade    4 non-null object
cid         4 non-null object
sem         4 non-null object
dtypes: int64(1), object(3)
memory usage: 208.0+ bytes

In [73]:
takes.dtypes # data types

sid          int64
expGrade    object
cid         object
sem         object
dtype: object

In [74]:
takes.count()

sid         4
expGrade    4
cid         4
sem         4
dtype: int64

### 3/5: COURSE

In [75]:
with open('course.csv') as course_file:
    course = pd.read_csv(course_file, ',', None, header='infer');

In [76]:
course

       cid  name  sem
0  550-001    DB  S15
1  677-001  Algo  S15
2  521-001    AI  F15

In [24]:
course.dtypes

cid     object
name    object
sem     object
dtype: object

In [25]:
course.rank() # assigns rank to all values

   cid  name  sem
0  2.0   2.0  1.5
1  1.0   1.0  1.5
2  3.0   3.0  3.0

In [77]:
course.sort_values(by='cid') # now ranked in ascending order
# course['cid'] = course['cid'].astype(int) # type casting

       cid  name  sem
2  521-001    AI  F15
0  550-001    DB  S15
1  677-001  Algo  S15

### 4/5: PROFESSOR

In [78]:
with open('professor.csv') as professor_file:
    professor = pd.read_csv(professor_file, ',', None, header='infer');

In [79]:
professor

   fid    name
0   11    Ives
1   12  Khanna
2   18  Marcus

### 5/5: TEACHES

In [80]:
with open('teaches.csv') as teaches_file:
    teaches = pd.read_csv(teaches_file, ',', None, header='infer');

In [81]:
teaches

   fid      cid  sem
0   11  550-001  S15
1   12  677-001  S15
2   18  521-001  F15

# Import database

In [82]:
import sqlite3
engine = sqlite3.connect('PRACTICE_DB')

# store dfs to database
student.to_sql(name='student', con=engine, if_exists = 'replace')
takes.to_sql(name='takes', con=engine, if_exists = 'replace')
course.to_sql(name='course', con=engine, if_exists = 'replace')
professor.to_sql(name='professor', con=engine, if_exists = 'replace')
teaches.to_sql(name='teaches', con=engine, if_exists = 'replace')

In [83]:
# Now let’s connect to the database (as above), and then load back your DataFrames 
# from SQL, using the syntax:
student = pd.read_sql('select * from student', engine)
takes = pd.read_sql('select * from takes', engine)
course = pd.read_sql('select * from course', engine)
professor = pd.read_sql('select * from professor', engine)
teaches = pd.read_sql('select * from teaches', engine)

In [84]:
student.info()
takes.info()
course.info()
professor.info()
teaches.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
index    3 non-null int64
sid      3 non-null int64
name     3 non-null object
dtypes: int64(2), object(1)
memory usage: 152.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 5 columns):
index       4 non-null int64
sid         4 non-null int64
expGrade    4 non-null object
cid         4 non-null object
sem         4 non-null object
dtypes: int64(2), object(3)
memory usage: 240.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
index    3 non-null int64
cid      3 non-null object
name     3 non-null object
sem      3 non-null object
dtypes: int64(1), object(3)
memory usage: 176.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
index    3 non-null int64
fid      3 non-null int64
name     3 non-null object
dtypes: int64(2), object(1)
memory usage: 152.0+ bytes
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
index    3 non-null int64
fid      3 non-null int64
cid      3 non-null object
sem      3 non-null object
dtypes: int64(2), object(2)
memory usage: 176.0+ bytes

In [85]:
import pandas as pd
from pandas import DataFrame
import numpy as np
import matplotlib.mlab as mlab
import matplotlib.pyplot as plt

# import sqlite3
# engine = sqlite3.connect('HW0_DB')
# dataframe = pd.read_sql('select * from name_df', engine)

## Queries

In [86]:
student

   index  sid  name
0      0    1  Jill
1      1    2    Bo
2      2    3  Maya

In [87]:
takes

   index  sid expGrade      cid  sem
0      0    1        A  550-001  S15
1      1    1        A  677-001  S15
2      2    3        C  521-001  F15
3      3    3        C  550-001  S15

In [88]:
course

   index      cid  name  sem
0      0  550-001    DB  S15
1      1  677-001  Algo  S15
2      2  521-001    AI  F15

In [89]:
professor

   index  fid    name
0      0   11    Ives
1      1   12  Khanna
2      2   18  Marcus

In [90]:
teaches

   index  fid      cid  sem
0      0   11  550-001  S15
1      1   12  677-001  S15
2      2   18  521-001  F15

In [91]:
cur = engine.cursor()
query = "SELECT * FROM student, takes, course WHERE student.sid=takes.sid AND takes.cid=course.cid"
cur.execute(query)
field_names = [i[0] for i in cur.description]
get_data = [xx for xx in cur]
cur.close()
# engine.close()
q1_df = DataFrame(get_data)
q1_df.columns = field_names

In [92]:
q1_df

,index,sid,name,index,sid,expGrade,cid,sem,index,cid,name,sem
0,0,1,Jill,0,1,A,550-001,S15,0,550-001,DB,S15
1,0,1,Jill,1,1,A,677-001,S15,1,677-001,Algo,S15
2,2,3,Maya,2,3,C,521-001,F15,2,521-001,AI,F15
3,2,3,Maya,3,3,C,550-001,S15,0,550-001,DB,S15

In [93]:
cur = engine.cursor()
query = "SELECT * FROM course WHERE cid LIKE '5%'"
cur.execute(query)
field_names = [i[0] for i in cur.description]
get_data = [xx for xx in cur]
cur.close()
# engine.close()
course_5xx_df = DataFrame(get_data)
course_5xx_df.columns = field_names

In [94]:
course_5xx_df # leaves out 677 course

   index      cid name  sem
0      0  550-001   DB  S15
1      2  521-001   AI  F15

In [98]:
cur = engine.cursor()
query = "WITH Bizz AS (SELECT sid AS student_id FROM student S WHERE S.name LIKE '%M_ya') SELECT T.expGrade FROM Bizz B INNER JOIN takes T ON B.student_id=T.sid WHERE T.cid='550-001';"
cur.execute(query)
field_names = [i[0] for i in cur.description]
get_data = [xx for xx in cur]
cur.close()
# engine.close()
exp_grade_550_df = DataFrame(get_data)
exp_grade_550_df.columns = field_names

In [99]:
exp_grade_550_df

  T.expGrade
0          C

In [111]:
student

   index  sid  name
0      0    1  Jill
1      1    2    Bo
2      2    3  Maya

In [112]:
takes

   index  sid expGrade      cid  sem
0      0    1        A  550-001  S15
1      1    1        A  677-001  S15
2      2    3        C  521-001  F15
3      3    3        C  550-001  S15

In [122]:
# Find the students with the best expected grades

cur = engine.cursor()
q = "SELECT DISTINCT S.name FROM student S, takes T WHERE S.sid=T.sid AND T.expGrade >= (SELECT DISTINCT expGrade FROM takes)"
cur.execute(q)
field_names = [i[0] for i in cur.description]
get_data = [xx for xx in cur]
cur.close()
# engine.close()
exp_grade_550_df = DataFrame(get_data)
exp_grade_550_df.columns = field_names

# SELECT S.name 
# FROM student S, takes T 
# WHERE S.sid=T.sid AND T.expGrade >= ANY 
#     (SELECT DISTINCT T.expGrade 
#      FROM takes T)

In [123]:
exp_grade_550_df # DIDNT USE 'ANY' keyword

   name
0  Jill
1  Maya

In [127]:
# Find the students who have taken subject that have (at any point) been taught by Prof. Marcus

cur = engine.cursor()
q = "SELECT DISTINCT S.name, S.sid FROM student S, takes T WHERE T.cid IN (SELECT ta.cid FROM professor p, teaches ta WHERE p.fid=ta.fid AND p.name='Marcus')"
cur.execute(q)
field_names = [i[0] for i in cur.description]
get_data = [xx for xx in cur]
cur.close()
# engine.close()
marcus_df = DataFrame(get_data)
marcus_df.columns = field_names

In [128]:
marcus_df

   name  sid
0  Jill    1
1    Bo    2
2  Maya    3

In [129]:
course

   index      cid  name  sem
0      0  550-001    DB  S15
1      1  677-001  Algo  S15
2      2  521-001    AI  F15

In [141]:
student

   index  sid  name
0      0    1  Jill
1      1    2    Bo
2      2    3  Maya

In [147]:
# Find all students who have taken DB but not AI

cur = engine.cursor()
q = "SELECT S.name, T.sid FROM takes T, course C, student S WHERE T.cid=C.cid AND S.sid=T.sid AND C.name='DB' AND NOT EXISTS (SELECT * FROM takes T2, course C2 WHERE T2.cid=C2.cid AND C2.name='AI' AND T.sid=T2.sid)"
cur.execute(q)
field_names = [i[0] for i in cur.description]
get_data = [xx for xx in cur]
cur.close()
# engine.close()
db_not_ai_df = DataFrame(get_data)
db_not_ai_df.columns = field_names

In [148]:
db_not_ai_df

   name  sid
0  Jill    1

### Creating a table

In [48]:
# creating table
c = engine.cursor()
create_table_sql = "CREATE TABLE employee (LastName character, DepartmentID number);"
c.execute(create_table_sql)
c.close()

OperationalError: table employee already exists

In [51]:
# inserting values in table
cursor = engine.cursor() 
insert_cmd = "INSERT INTO employee (LastName, DepartmentID) VALUES ('Rafferty', 31), ('Jones', 33), ('Steinberg', 33), ('Robinson', 34), ('Smith', 34), ('John', null);"
number_of_rows = cursor.execute(insert_cmd)
engine.commit()
cursor.close()

In [52]:
employee = pd.read_sql('select * from employee', engine)
employee

    LastName  DepartmentID
0   Rafferty          31.0
1      Jones          33.0
2  Steinberg          33.0
3   Robinson          34.0
4      Smith          34.0
5       John           NaN

In [53]:
# creating table
c = engine.cursor()
create_table_sql = "CREATE TABLE department (DepartmentID number, DepartmentName character);"
c.execute(create_table_sql)
c.close()

In [54]:
# inserting values in table
cursor = engine.cursor() 
insert_cmd = "INSERT INTO department (DepartmentID, DepartmentName) VALUES (31, 'Sales'), (33, 'Engineering'), (34, 'Clerical'), (35, 'Marketing');"
number_of_rows = cursor.execute(insert_cmd)
engine.commit()
cursor.close()

In [55]:
department = pd.read_sql('select * from department', engine)
department

   DepartmentID DepartmentName
0            31          Sales
1            33    Engineering
2            34       Clerical
3            35      Marketing

In [57]:
# Joins

cur = engine.cursor()
query = "SELECT * FROM employee emp NATURAL JOIN department dept WHERE emp.DepartmentID=dept.DepartmentID"
cur.execute(query)
field_names = [i[0] for i in cur.description]
get_data = [xx for xx in cur]
cur.close()
# engine.close()
emp_nat_join_df = DataFrame(get_data)
emp_nat_join_df.columns = field_names

In [58]:
emp_nat_join_df # avoids repeats

    LastName  DepartmentID DepartmentName
0   Rafferty            31          Sales
1      Jones            33    Engineering
2  Steinberg            33    Engineering
3   Robinson            34       Clerical
4      Smith            34       Clerical

In [61]:
cur = engine.cursor()
query = "SELECT * FROM employee emp LEFT OUTER JOIN department dept ON emp.DepartmentID=dept.DepartmentID"
cur.execute(query)
field_names = [i[0] for i in cur.description]
get_data = [xx for xx in cur]
cur.close()
# engine.close()
emp_L_outer_join_df = DataFrame(get_data)
emp_L_outer_join_df.columns = field_names

In [62]:
emp_L_outer_join_df

    LastName  DepartmentID  DepartmentID DepartmentName
0   Rafferty          31.0          31.0          Sales
1      Jones          33.0          33.0    Engineering
2  Steinberg          33.0          33.0    Engineering
3   Robinson          34.0          34.0       Clerical
4      Smith          34.0          34.0       Clerical
5       John           NaN           NaN           None

In [63]:
# cur = engine.cursor()
# query = "SELECT * FROM employee emp RIGHT OUTER JOIN department dept ON emp.DepartmentID=dept.DepartmentID"
# cur.execute(query)
# field_names = [i[0] for i in cur.description]
# get_data = [xx for xx in cur]
# cur.close()
# # engine.close()
# emp_R_outer_join_df = DataFrame(get_data)
# emp_R_outer_join_df.columns = field_names

OperationalError: RIGHT and FULL OUTER JOINs are not currently supported